app/views/dashborad/index.html.erb


<%= pie_chart Kind.group(:name).count %>
---
SELECT COUNT(*) AS count_all, "kinds"."name" AS kinds_name FROM "kinds" GROUP BY "kinds"."name"