app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" ORDER BY "categories"."created_at" DESC
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."category_id" = ?  [["category_id", 10]]
---
  def api
    categories = Category.all.order(created_at: :desc)
    @categories = categories.map {|category| {
      id: category.id,
      name: category.name,
      bookmarks_name: category.bookmarks {|mark| mark.name}.map {|mark| mark.name },
      bookmarks_url: category.bookmarks {|mark| mark.name}.map {|mark| mark.url }

INSERT INTO "categories" ("name", "visibility", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "musica"], ["visibility", 1], ["created_at", "2020-07-24 01:52:29.333968"], ["updated_at", "2020-07-24 01:52:29.333968"]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save